{"pageProps":{"project":{"slug":"cdc-gov-5","title":"CDC.gov","description":"More than a decade of building the next generation of CDC.gov.","images":["/images/project-cdc.webp"],"content":"<div class=\"max-w-4xl mx-auto rounded-lg\"><section class=\"mb-8\"><h2 class=\"font-bold mb-4 text-2xl\">Project Overview: Current CDC.gov Template Redesign</h2><p class=\"leading-relaxed text-gray-300\">The latest version of the CDC.gov Template introduces a brand-new layout, significantly reducing the amount of code and bringing in a fresh theme and color scheme and components which are aligned with the U.S. Web Design System (USWDS). This version was rewritten from the ground up using a heavily customized Bootstrap 5 framework, integrating with the new Content Management System (CMS) and providing a modern, streamlined experience.</section><section class=mb-8><h3 class=\"font-semibold mb-3 text-xl\">Innovative Features and Layout Enhancements</h3><p class=\"leading-relaxed text-gray-300\">This new Template includes several new features, such as a dynamic hero area, smooth animations, and a sticky right rail for better navigation. It uses structured layouts with semantic elements like <code>main</code>, <code>section</code>, and <code>aside</code>; the HTML elements chosen accurately reflect the purpose and content, enhancing clarity and accessibility. Additionally, new menus and sticky navigation were introduced to enhance user experience on both desktop and mobile. The use of Animate on Scroll (AOS) brings sections to life as users scroll through the page.</section><section class=mb-8><h3 class=\"font-semibold mb-3 text-xl\">Updated Components and Features</h3><p class=\"leading-relaxed text-gray-300\">All components in the Template have been updated with the latest design standards. Custom SCSS mixins and an object-oriented approach to JavaScript provide a robust foundation for future enhancements, ensuring scalability and maintainability.</section><section class=mb-8><h3 class=\"font-semibold mb-3 text-xl\">Collaboration and Seamless Integration</h3><p class=\"leading-relaxed text-gray-300\">The development process involved close collaboration with both UX and back-end developers, ensuring that design updates were not only visually appealing but also fully integrated with the new CMS. The end result is a Template that is both user-friendly and easy to manage, providing a cohesive experience across all CDC.gov pages.</section><section><h3 class=\"font-semibold mb-3 text-xl\">Outcome: Modern, Efficient, and Scalable Web Solution</h3><p class=\"leading-relaxed text-gray-300\">The new CDC.gov Template is a modern, efficient, and scalable web solution that simplifies maintenance and ensures consistency across the site. With reduced code, enhanced features, and seamless integration, it sets a new standard for the agency's web presence, aligning with current web trends and user expectations.</section></div>","backgroundColor":"#1a1a1a","svgPattern":"","backgroundSVG":"bg-style-1"}},"__N_SSG":true}