{"pageProps":{"project":{"slug":"cdc-covid","title":"COVID 2019","description":"Developing innovative solutions to ensure the public has access to vital COVID information.","images":["/images/project-covid.webp","/images/cdc-covid-group.webp"],"content":"<div class=\"max-w-4xl mx-auto rounded-lg\"><section class=mb-8><h2 class=\"font-bold mb-4 text-2xl\">Project Overview: COVID-19 Pandemic Response Design and Updates for CDC.gov</h2><p class=\"leading-relaxed text-gray-600\">During the COVID-19 pandemic, I played a pivotal role in the rapid development, update, and redesign of the CDC.gov platform to meet the evolving needs of both the agency and the public. This project focused on enhancing design elements, updating controls, and implementing new mobile-friendly features to ensure critical information was accessible and easy to navigate.</section><section class=mb-8><h3 class=\"font-semibold mb-3 text-xl\">Rapid Prototyping and Iterative Design to Meet Urgent Needs</h3><p class=\"leading-relaxed text-gray-600\">Given the rapidly changing nature of the pandemic, this project required the development of multiple iterations of designs and prototypes. These were quickly adjusted based on both internal stakeholder feedback and public response to ensure the interface remained user-friendly, informative, and responsive to the needs of the moment.</section><section class=mb-8><h3 class=\"font-semibold mb-3 text-xl\">Enhanced Controls and Improved Navigation for Key Features</h3><p class=\"leading-relaxed text-gray-600\">A key focus of this redesign was on creating and updating components that facilitated easier access to crucial information. New components were introduced for features like “Find a Vaccine” and public safety tips, such as “Wearing a Mask” and “How to Protect Yourself.” These updates were crucial in guiding the public through important health measures and resources efficiently.</section><section class=mb-8><h3 class=\"font-semibold mb-3 text-xl\">Mobile Optimization and Updated Menus for Broader Reach</h3><p class=\"leading-relaxed text-gray-600\">Recognizing the importance of mobile accessibility, the project included substantial updates to the site’s mobile experience. This involved redesigning menus, optimizing navigation, and ensuring that all new components were fully responsive, allowing users on all devices to access vital information without difficulty.</section><section><h3 class=\"font-semibold mb-3 text-xl\">Outcome: Improved Accessibility and Agile Response</h3><p class=\"leading-relaxed text-gray-600\">The redesigned components and controls played a critical role in effectively delivering essential information during the pandemic. By incorporating enhanced mobile navigation, intuitive design, and responsive layouts, the site provided a more accessible and user-friendly experience. This agile approach allowed CDC.gov to swiftly adapt to the evolving needs of the public health crisis, ensuring timely and accurate guidance was consistently available to users across all platforms.</section></div>","backgroundColor":"#1a1a1a","svgPattern":"","backgroundSVG":"bg-style-3"}},"__N_SSG":true}