{"pageProps":{"project":{"slug":"cdc-gov-4","title":"CDC.gov","description":"Transforming the CDC.gov website into a modern, fully responsive experience.","image":"/images/project-cdc-4.webp","content":"<div class=\"max-w-4xl mx-auto rounded-lg\"> <section class=\"mb-8\"> <h2 class=\"text-2xl font-bold mb-4\">Project Overview: Redesigning the CDC.gov Templates</h2> <p class=\"text-gray-600 leading-relaxed\">During my time with Northrop Grumman, I was tasked with leading the redesign and upgrade of the CDC.gov templates, a foundational framework used by all centers within the agency to develop their webpages and applications, regardless of platform (.NET, PHP, static sites, etc.). This project aimed to move the template from version 2 to version 3, bringing in significant advancements in design standards, user experience, and technological adaptability.</p> </section> <section class=\"mb-8\"> <h3 class=\"text-xl font-semibold mb-3\">Pioneering Responsive Design: Navigating Initial Resistance</h3> <p class=\"text-gray-600 leading-relaxed\">One of the major improvements introduced in this upgrade was the adoption of responsive design. At that time, mobile traffic was not prioritized by the agency, leading to some resistance in embracing this shift. However, recognizing the future importance of mobile accessibility, I spearheaded efforts to make responsive design a core principle of the new template. This laid the groundwork for a more flexible and future-proof web experience for CDC.gov, ensuring usability across various devices and screen sizes.</p> </section> <section class=\"mb-8\"> <h3 class=\"text-xl font-semibold mb-3\">Collaboration and Implementation: Bridging Design and Functionality</h3> <p class=\"text-gray-600 leading-relaxed\">Throughout this process, I worked closely with the UX team to ensure the new templates met modern usability standards while enhancing visual appeal. We focused on intuitive navigation, clear information hierarchy, and accessibility to align with user needs and expectations. Simultaneously, I collaborated with the back-end team to seamlessly integrate these design improvements into the existing Web Content Management System (WCMS), ensuring that the upgraded templates were both visually consistent and functionally robust across all centers.</p> </section> <section> <h3 class=\"text-xl font-semibold mb-3\">Outcome: Enhanced Design, Streamlined Processes, and Improved Functionality</h3> <p class=\"text-gray-600 leading-relaxed\">This upgrade wasn't just a visual overhaul—it was a comprehensive enhancement of the CDC.gov digital ecosystem. By introducing responsive design and improving the integration process within the WCMS, we set a new standard for the agency’s web presence. The redesigned templates offered a more cohesive user experience, greater adaptability for future changes, and a solid foundation for ongoing compliance with accessibility standards, such as Section 508 and WCAG.</p> </section> </div>","backgroundColor":"#1a1a1a","svgPattern":"","backgroundSVG":"bg-style-2"}},"__N_SSG":true}